QuantumLeaps/qpcpp/examples/arm-cortex/qk/gnu/lwip-qk-stm3210c-eval/table.cpp
//////////////////////////////////////////////////////////////////////////////
// Product: DPP example with lwIP and direct LCD output, STM3210C-EVAL board
// Last Updated for Version: 4.5.00
// Date of the Last Update:  May 20, 2012
//
//                    Q u a n t u m     L e a P s
//                    ---------------------------
//                    innovating embedded systems
//
// Copyright (C) 2002-2012 Quantum Leaps, LLC. All rights reserved.
//
// This program is open source software: you can redistribute it and/or
// modify it under the terms of the GNU General Public License as published
// by the Free Software Foundation, either version 2 of the License, or
// (at your option) any later version.
//
// Alternatively, this program may be distributed and modified under the
// terms of Quantum Leaps commercial licenses, which expressly supersede
// the GNU General Public License and are specifically designed for
// licensees interested in retaining the proprietary status of their code.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program. If not, see <http://www.gnu.org/licenses/>.
//
// Contact information:
// Quantum Leaps Web sites: http://www.quantum-leaps.com
//                          http://www.state-machine.com
// e-mail:                  info@quantum-leaps.com
//////////////////////////////////////////////////////////////////////////////
#include "qp_port.h"                                    // QP port header file
#include "dpp.h"                      // application events and active objects
#include "bsp.h"                          // Board Support Package header file

extern "C" {
    //#include "stm32f10x.h"
    //#include "stm32_eval.h"
    #include "stm3210c_eval_lcd.h"
}

#include <stdio.h>

Q_DEFINE_THIS_FILE

// Active object class -------------------------------------------------------
class Table : public QActive {
    uint8_t m_fork[N_PHILO];
    uint8_t m_isHungry[N_PHILO];
    uint8_t m_displayOn;
    uint8_t m_udpCtr;
    QTimeEvt m_te_DISPLAY_TIMEOUT;

public:
    Table();                                                           // ctor

private:
    static QState initial(Table *me, QEvt const *e);
    static QState serving(Table *me, QEvt const *e);

private:
    void displayInit(void);
    void displayOn(void);
    void displayOff(void);
    void displayPhilStat(uint8_t n, char const *stat);
    void displyIPAddr(char const *ip_addr);
    void displyUdpText(char const *text);
    void displyCgiText(char const *text);
};

#define RIGHT(n_) ((uint8_t)(((n_) + (N_PHILO - 1)) % N_PHILO))
#define LEFT(n_)  ((uint8_t)(((n_) + 1) % N_PHILO))
enum ForkState { FREE, USED };

#ifdef Q_SPY
enum AppRecords {                     // application-specific QS trace records
    PHILO_STAT = QS_USER,
    CGI_TEXT,
    UDP_TEXT,
};
#endif

// Local objects -------------------------------------------------------------
static Table l_table;        // the single instance of the Table active object

enum TablePrivateSignals {
   DISPLAY_TIMEOUT_SIG = MAX_SIG
};

#define DISPLAY_TIMEOUT (BSP_TICKS_PER_SEC * 30)

// Global-scope objects ------------------------------------------------------
QActive * const AO_Table = (QActive *)&l_table;         // "opaque" AO pointer

//............................................................................
Table::Table()
   : QActive((QStateHandler)&Table::initial),
      m_te_DISPLAY_TIMEOUT(DISPLAY_TIMEOUT_SIG)

{
    uint8_t n;
    for (n = 0; n < N_PHILO; ++n) {
        m_fork[n] = FREE;
        m_isHungry[n] = 0;
    }
    m_udpCtr = 0;
}
//............................................................................
QState Table::initial(Table *me, QEvt const *e) {
    (void)e;           // suppress the compiler warning about unused parameter

    me->displayInit();                          // Initialize the OLED display

    me->subscribe(DONE_SIG);               // subscribe to published events...
    me->subscribe(BTN_DOWN_SIG);
    me->subscribe(DISPLAY_IPADDR_SIG);
    me->subscribe(DISPLAY_CGI_SIG);
    me->subscribe(DISPLAY_UDP_SIG);

    QS_OBJ_DICTIONARY(&l_table);
    QS_FUN_DICTIONARY(&QHsm::top);
    QS_FUN_DICTIONARY(&Table::initial);
    QS_FUN_DICTIONARY(&Table::serving);

    QS_SIG_DICTIONARY(DONE_SIG,            0);               // global signals
    QS_SIG_DICTIONARY(EAT_SIG,             0);
    QS_SIG_DICTIONARY(DISPLAY_IPADDR_SIG,  0);
    QS_SIG_DICTIONARY(DISPLAY_CGI_SIG,     0);
    QS_SIG_DICTIONARY(DISPLAY_UDP_SIG,     0);

    QS_SIG_DICTIONARY(HUNGRY_SIG,          me);       // signal just for Table
    QS_SIG_DICTIONARY(DISPLAY_TIMEOUT_SIG, me);       // signal just for Table

    return Q_TRAN(&Table::serving);
}
//............................................................................
QState Table::serving(Table *me, QEvt const *e) {
    uint8_t n, m;
    TableEvt *pe;

    switch (e->sig) {
        case Q_ENTRY_SIG: {
            me->m_te_DISPLAY_TIMEOUT.postEvery((QActive *)me,
                                               DISPLAY_TIMEOUT);
            me->displayOn();
            return Q_HANDLED();
        }
        case Q_EXIT_SIG: {
            me->m_te_DISPLAY_TIMEOUT.disarm();
            me->displayOff();
            return Q_HANDLED();
        }
        case HUNGRY_SIG: {
            n = ((TableEvt const *)e)->philoNum;
                         // phil ID must be in range and he must be not hungry
            Q_ASSERT((n < N_PHILO) && (!me->m_isHungry[n]));

            me->displayPhilStat(n, "hungry  ");
            m = LEFT(n);
            if ((me->m_fork[m] == FREE) && (me->m_fork[n] == FREE)) {
                me->m_fork[m] = me->m_fork[n] = USED;
                pe = Q_NEW(TableEvt, EAT_SIG);
                pe->philoNum = n;
                QF::publish(pe);
                me->displayPhilStat(n, "eating  ");
            }
            else {
                me->m_isHungry[n] = 1;
            }
            return Q_HANDLED();
        }
        case DONE_SIG: {
            n = ((TableEvt const *)e)->philoNum;
                         // phil ID must be in range and he must be not hungry
            Q_ASSERT((n < N_PHILO) && (!me->m_isHungry[n]));

            me->displayPhilStat(n, "thinking");
            m = LEFT(n);
                                         // both forks of Phil[n] must be used
            Q_ASSERT((me->m_fork[n] == USED) && (me->m_fork[m] == USED));

            me->m_fork[m] = me->m_fork[n] = FREE;
            m = RIGHT(n);                          // check the right neighbor
            if (me->m_isHungry[m] && (me->m_fork[m] == FREE)) {
                me->m_fork[n] = me->m_fork[m] = USED;
                me->m_isHungry[m] = 0;
                pe = Q_NEW(TableEvt, EAT_SIG);
                pe->philoNum = m;
                QF::publish(pe);
                me->displayPhilStat(m, "eating  ");
            }
            m = LEFT(n);                            // check the left neighbor
            n = LEFT(m);                     // left fork of the left neighbor
            if (me->m_isHungry[m] && (me->m_fork[n] == FREE)) {
                me->m_fork[m] = me->m_fork[n] = USED;
                me->m_isHungry[m] = 0;
                pe = Q_NEW(TableEvt, EAT_SIG);
                pe->philoNum = m;
                QF::publish(pe);
                me->displayPhilStat(m, "eating  ");
            }
            return Q_HANDLED();
        }
        case BTN_DOWN_SIG: {
            me->displayOn();
            return Q_HANDLED();
        }
        case DISPLAY_TIMEOUT_SIG: {
            me->displayOff();
            return Q_HANDLED();
        }
        case DISPLAY_IPADDR_SIG: {
            me->displyIPAddr(((TextEvt *)e)->text);
            return Q_HANDLED();
        }
        case DISPLAY_CGI_SIG: {
            me->displyCgiText(((TextEvt *)e)->text);
            return Q_HANDLED();
        }
        case DISPLAY_UDP_SIG: {
            TextEvt *te;

            me->displyUdpText(((TextEvt *)e)->text);
            ++me->m_udpCtr;

            te = Q_NEW(TextEvt, SEND_UDP_SIG);
            snprintf(te->text, Q_DIM(te->text), "%s-%d",
                     ((TextEvt const *)e)->text, (int)me->m_udpCtr);
            AO_LwIPMgr->postFIFO(te);                         // post directly

            return Q_HANDLED();
        }
    }
    return Q_SUPER(&QHsm::top);
}

// helper functions for the display ..........................................
void Table::displayInit(void) {
    STM3210C_LCD_Init();                                 // initialize the LCD
    LCD_Clear(White);                                         // clear the LCD
    LCD_SetBackColor(Grey);
    LCD_SetTextColor(Black);
    LCD_DisplayString(Line0, 0, "   Quantum Leaps    ");
    LCD_DisplayString(Line1, 0, "  lwIP/DPP example  ");
    LCD_DisplayString(Line2, 0, " QP/C++ (QK)        ");
    LCD_DisplayString(Line2, 14*16, QF::getVersion());
    LCD_SetBackColor(White);
    LCD_DisplayString(Line4, 0, "IP :");
    LCD_DisplayString(Line5, 0, "DPP:");
    LCD_DisplayString(Line6, 0, "CGI:");
    LCD_DisplayString(Line7, 0, "UDP:");
    LCD_SetBackColor(Black);
    LCD_SetTextColor(Yellow);
    LCD_DisplayString(Line9, 0, "  state-machine.com ");
    LCD_SetBackColor(Blue);
    LCD_SetTextColor(White);
    LCD_DisplayString(Line5, 4*16, "0 ,1 ,2 ,3 ,4    ");
    m_displayOn = 1;
}
//............................................................................
void Table::displayOn(void) {
    m_te_DISPLAY_TIMEOUT.rearm(DISPLAY_TIMEOUT);
    if (!m_displayOn) {
        m_displayOn = 1;
        LCD_DisplayOn();
    }
}
//............................................................................
void Table::displayOff(void) {
    if (m_displayOn) {
        m_displayOn = 0;
        LCD_DisplayOff();
    }
}
//............................................................................
void Table::displayPhilStat(uint8_t n, char const *stat) {
    if (m_displayOn) {
        LCD_DisplayChar(Line5, (3*16*n + 5*16), stat[0]);
    }
    QS_BEGIN(PHILO_STAT, AO_Philo[n])     // application-specific record begin
        QS_U8(1, n);                                     // Philosopher number
        QS_STR(stat);                                    // Philosopher status
    QS_END()
}
//............................................................................
void Table::displyIPAddr(char const *ip_addr) {
    displayOn();                                 // make sure the screen is on
    LCD_DisplayString(Line4, 4*16, "                ");                // wipe
    LCD_DisplayString(Line4, 4*16, ip_addr);
}
//............................................................................
void Table::displyCgiText(char const *text) {
    displayOn();                                 // make sure the screen is on
    LCD_DisplayString(Line6, 4*16, "                ");                // wipe
    LCD_DisplayString(Line6, 4*16, text);

    QS_BEGIN(CGI_TEXT, 0)                 // application-specific record begin
        QS_STR(text);                                             // User text
    QS_END()
}
//............................................................................
void Table::displyUdpText(char const *text) {
    displayOn();                                 // make sure the screen is on
    LCD_DisplayString(Line7, 4*16, "                ");                // wipe
    LCD_DisplayString(Line7, 4*16, text);

    QS_BEGIN(UDP_TEXT, 0)                 // application-specific record begin
        QS_STR(text);                                             // User text
    QS_END()
}

